devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
/*==============================================================================
File    can.c

Author  Daniel Zorychta

Brief   CAN driver

        Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

        This program is free software; you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation and modified by the dnx RTOS exception.

        NOTE: The modification  to the GPL is  included to allow you to
              distribute a combined work that includes dnx RTOS without
              being obliged to provide the source  code for proprietary
              components outside of the dnx RTOS.

        The dnx RTOS  is  distributed  in the hope  that  it will be useful,
        but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
        MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
        GNU General Public License for more details.

        Full license text is available on the following file: doc/license.txt.

==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "config.h"
#include "../can_ioctl.h"

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#include "stm32f1/lib/stm32f10x_rcc.h"
#elif defined(ARCH_stm32f3)
#include "stm32f3/stm32f3xx.h"
#include "stm32f3/lib/stm32f3xx_ll_rcc.h"
#elif defined(ARCH_stm32f4)
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/lib/stm32f4xx_rcc.h"
#elif defined(ARCH_stm32f7)
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/lib/stm32f7xx_ll_rcc.h"
#endif

/*==============================================================================
  Local macros
==============================================================================*/
#define TX_MAILBOXES            3
#define RX_MAILBOXES            2
#define RX_FIFO_DEPTH           __CAN_CFG_RX_FIFO_SIZE__
#define INIT_TIMEOUT            2000
#define MTX_TIMEOUT             2000

#if defined(ARCH_stm32f1)
#if defined(STM32F10X_LD) || defined(STM32F10X_MD) || defined(STM32F10X_HD)\
 || defined(STM32F10X_XL)
#define CAN1_TX_IRQn            USB_HP_CAN1_TX_IRQn
#define CAN1_RX0_IRQn           USB_LP_CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      USB_HP_CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     USB_LP_CAN1_RX0_IRQHandler
#define CAN1_RX1_IRQHANDLER     CAN1_RX1_IRQHandler
#define CAN1_SCE_IRQHANDLER     CAN1_SCE_IRQHandler
#endif

#ifdef STM32F10X_CL
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#define CAN1_RX1_IRQHANDLER     CAN1_RX1_IRQHandler
#define CAN1_SCE_IRQHANDLER     CAN1_SCE_IRQHandler
#define CAN2_TX_IRQHANDLER      CAN2_TX_IRQHandler
#define CAN2_RX0_IRQHANDLER     CAN2_RX0_IRQHandler
#define CAN2_RX1_IRQHANDLER     CAN2_RX1_IRQHandler
#define CAN2_SCE_IRQHANDLER     CAN2_SCE_IRQHandler
#endif
#endif

#if defined(ARCH_stm32f3)
#define CAN1_TX_IRQn            CAN_TX_IRQn
#define CAN1_RX0_IRQn           CAN_RX0_IRQn
#define CAN1_TX_IRQHANDLER      USB_HP_CAN_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     USB_LP_CAN_RX0_IRQHandler
#define CAN1_RX1_IRQHANDLER     CAN_RX1_IRQHandler
#define CAN1_SCE_IRQHandler     CAN_SCE_IRQHandler
#define RCC_APB1ENR_CAN1EN      RCC_APB1ENR_CANEN
#define RCC_APB1RSTR_CAN1RST    RCC_APB1RSTR_CANRST
#define RCC_APB1RSTR_CAN1RST    RCC_APB1RSTR_CANRST
#define CAN1_RX0_IRQn           CAN_RX0_IRQn
#define CAN1_RX1_IRQn           CAN_RX1_IRQn
#define CAN1_SCE_IRQn           CAN_SCE_IRQn
#endif

#if defined(ARCH_stm32f4)
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#define CAN1_RX1_IRQHANDLER     CAN1_RX1_IRQHandler
#define CAN1_SCE_IRQHANDLER     CAN1_SCE_IRQHandler
#define CAN2_TX_IRQHANDLER      CAN2_TX_IRQHandler
#define CAN2_RX0_IRQHANDLER     CAN2_RX0_IRQHandler
#define CAN2_RX1_IRQHANDLER     CAN2_RX1_IRQHandler
#define CAN2_SCE_IRQHANDLER     CAN2_SCE_IRQHandler
#endif

#if defined(ARCH_stm32f7)
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#define CAN1_RX1_IRQHANDLER     CAN1_RX1_IRQHandler
#define CAN1_SCE_IRQHANDLER     CAN1_SCE_IRQHandler
#define CAN2_TX_IRQHANDLER      CAN2_TX_IRQHandler
#define CAN2_RX0_IRQHANDLER     CAN2_RX0_IRQHandler
#define CAN2_RX1_IRQHANDLER     CAN2_RX1_IRQHandler
#define CAN2_SCE_IRQHANDLER     CAN2_SCE_IRQHandler
#define CAN3_TX_IRQHANDLER      CAN3_TX_IRQHandler
#define CAN3_RX0_IRQHANDLER     CAN3_RX0_IRQHandler
#define CAN3_RX1_IRQHANDLER     CAN3_RX1_IRQHandler
#define CAN3_SCE_IRQHANDLER     CAN3_SCE_IRQHandler
#endif

/*==============================================================================
  Local object types
==============================================================================*/
enum CAN_COUNT {
        #if defined(RCC_APB1ENR_CAN1EN)
        _CAN1,
        #endif
        #if defined(RCC_APB1ENR_CAN2EN)
        _CAN2,
        #endif
        #if defined(RCC_APB1ENR_CAN3EN)
        _CAN3,
        #endif
        _CAN_COUNT
};

typedef struct {
        u8_t       major;
        u8_t       minor;
        u32_t      send_timeout;
        u32_t      recv_timeout;
        u32_t      txpend_ctr;
        u32_t      rxpend_ctr;
        kmtx_t     *config_mtx;
        kmtx_t     *txmbox_mtx[TX_MAILBOXES];
        kqueue_t   *txrdy_q[TX_MAILBOXES];
        kqueue_t   *rxqueue_q;
        u64_t      tx_frames;
        u64_t      tx_bytes;
        u64_t      rx_frames;
        u64_t      rx_bytes;
        u32_t      rx_overrun;
        u32_t      baud;
        CAN_mode_t mode;
} CAN_t;

/* CAN registers */
typedef struct {
        CAN_TypeDef   *CAN;
        __IO uint32_t *APBENR;
        __IO uint32_t *APBRSTR;
        uint32_t       APBENR_CANEN;
        uint32_t       APBRSTR_CANRSTR;
        IRQn_Type      TX_IRQn;
        IRQn_Type      RX0_IRQn;
        IRQn_Type      RX1_IRQn;
        IRQn_Type      SCE_IRQn;
        u8_t           FILTERS_COUNT;
} CAN_CFG_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void relese_resources(CAN_t *hdl);
static int configure(CAN_t *hdl, const CAN_config_t *cfg);
static int set_init_mode(CAN_t *hdl);
static int set_normal_mode(CAN_t *hdl);
static int set_sleep_mode(CAN_t *hdl);
static int set_filter(CAN_t *hdl, const CAN_filter_t *filter);
static int disable_filter(CAN_t *hdl, u32_t filter_no);
static int send_msg(CAN_t *hdl, const CAN_msg_t *msg, u32_t timeout_ms);
static int recv_msg(CAN_t *hdl, CAN_msg_t *msg, u32_t timeout_ms);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(CAN);

