devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        return err;
}

//==============================================================================
/**
 * @brief Release device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_RELEASE(CAN, void *device_handle)
{
        CAN_t *hdl = device_handle;

        // lock access to module
        NVIC_ClearPendingIRQ(CANX[hdl->major].TX_IRQn);
        NVIC_DisableIRQ(CANX[hdl->major].TX_IRQn);

        NVIC_ClearPendingIRQ(CANX[hdl->major].RX0_IRQn);
        NVIC_DisableIRQ(CANX[hdl->major].RX0_IRQn);

        NVIC_ClearPendingIRQ(CANX[hdl->major].RX1_IRQn);
        NVIC_DisableIRQ(CANX[hdl->major].RX1_IRQn);

        NVIC_ClearPendingIRQ(CANX[hdl->major].SCE_IRQn);
        NVIC_DisableIRQ(CANX[hdl->major].SCE_IRQn);

        sys_sleep_ms(100);

        CAN_HDL[hdl->major] = NULL;

        // finish TX pending transfers
        int err = ECANCELED;

        for (u32_t n = 0; n < hdl->txpend_ctr; n++) {

                for (int i = 0; i < TX_MAILBOXES; i++) {
                        sys_queue_send(hdl->txrdy_q[i], &err, 0);
                }

                sys_sleep_ms(10);
        }

        // finish RX pending queue
        CAN_FIFOMailBox_TypeDef mbox;
        memset(&mbox, 0, sizeof(CAN_FIFOMailBox_TypeDef));

        for (u32_t n = 0; n < hdl->rxpend_ctr; n++) {
                sys_queue_send(hdl->rxqueue_q, &mbox, 0);
        }

        // wait for finish all transfers
        while ((hdl->txpend_ctr > 0) || (hdl->rxpend_ctr > 0)) {
                sys_sleep_ms(10);
        }

        // release all resources
        relese_resources(hdl);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Open device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_OPEN(CAN, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_CLOSE(CAN, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_WRITE(CAN,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG1(fpos);

        CAN_t *hdl = device_handle;

        int err = EINVAL;

        if (count == sizeof(CAN_msg_t)) {

                const CAN_msg_t *msg = (void*)src;

                u32_t timeout_ms = fattr.non_blocking_wr ? 0 : hdl->send_timeout;

                err = send_msg(hdl, msg, timeout_ms);

                if (!err) {
                        *wrcnt += sizeof(CAN_msg_t);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Read data from device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_READ(CAN,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG1(fpos);

        CAN_t *hdl = device_handle;

        int err = EINVAL;

        if (count == sizeof(CAN_msg_t)) {

                u32_t timeout_ms = fattr.non_blocking_rd ? 0 : hdl->recv_timeout;

                err = recv_msg(hdl, cast(CAN_msg_t*, dst), timeout_ms);

                if (!err) {
                        *rdcnt += sizeof(CAN_msg_t);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief IO control.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_IOCTL(CAN, void *device_handle, int request, void *arg)
{
        CAN_t *hdl = device_handle;

