devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        int err = EINVAL;

        switch (request) {
        case IOCTL_CAN__CONFIGURE:
                if (arg) {
                        err = configure(hdl, arg);
                }
                break;

        case IOCTL_CAN__SET_FILTER:
                if (arg) {
                        err = set_filter(hdl, arg);
                }
                break;

        case IOCTL_CAN__DISABLE_FILTER:
                if (arg) {
                        err = disable_filter(hdl, *cast(u32_t*, arg));
                }
                break;

        case IOCTL_CAN__GET_NUMBER_OF_FILTERS:
                if (arg) {
                        *cast(u32_t*, arg) = CANX[hdl->major].FILTERS_COUNT;
                        err = ESUCC;
                }
                break;

        case IOCTL_CAN__SET_MODE:
                if (arg) {
                        CAN_mode_t mode = *cast(CAN_mode_t*, arg);
                        switch (mode) {
                        case CAN_MODE__INIT  : err = set_init_mode(hdl); break;
                        case CAN_MODE__NORMAL: err = set_normal_mode(hdl); break;
                        case CAN_MODE__SLEEP : err = set_sleep_mode(hdl); break;
                        default              : err = EINVAL; break;
                        }

                        if (!err) {
                                hdl->mode = mode;
                        }
                }
                break;

        case IOCTL_CAN__SET_SEND_TIMEOUT:
                if (arg) {
                        hdl->send_timeout = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_CAN__SET_RECV_TIMEOUT:
                if (arg) {
                        hdl->recv_timeout = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_CAN__SEND_MSG:
                if (arg) {
                        err = send_msg(hdl, arg, hdl->send_timeout);
                }
                break;

        case IOCTL_CAN__RECV_MSG:
                if (arg) {
                        err = recv_msg(hdl, arg, hdl->recv_timeout);
                }
                break;

        case IOCTL_CAN__GET_STATUS:
                if (arg) {
                        CAN_status_t *status = arg;

                        // CAN bus status
                        if (CANX[hdl->major].CAN->ESR & CAN_ESR_BOFF) {
                                status->can_bus_status = CAN_BUS_STATUS__OFF;

                        } else if (CANX[hdl->major].CAN->ESR & CAN_ESR_EPVF) {
                                status->can_bus_status = CAN_BUS_STATUS__PASSIVE;

                        } else if (CANX[hdl->major].CAN->ESR & CAN_ESR_EWGF) {
                                status->can_bus_status = CAN_BUS_STATUS__WARNING;

                        } else {
                                status->can_bus_status = CAN_BUS_STATUS__OK;
                        }

                        // CAN mode
                        status->mode = hdl->mode;
                        status->frame_mode = CAN_FRAME_MODE__CLASSIC;

                        // error countes
                        status->rx_error_ctr   = ((CANX[hdl->major].CAN->ESR & CAN_ESR_REC) >> 24);
                        status->tx_error_ctr   = ((CANX[hdl->major].CAN->ESR & CAN_ESR_TEC) >> 16);
                        status->rx_overrun_ctr = hdl->rx_overrun;

                        // transfer stats
                        status->tx_frames = hdl->tx_frames;
                        status->tx_bytes  = hdl->tx_bytes;
                        status->rx_frames = hdl->rx_frames;
                        status->rx_bytes  = hdl->rx_bytes;

                        // baud
                        status->nominal_baud_bps = hdl->baud;
                        status->data_baud_bps = hdl->baud;

                        err = ESUCC;
                }
                break;

        default:
                err = EBADRQC;
                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_FLUSH(CAN, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_STAT(CAN, void *device_handle, struct vfs_dev_stat *device_stat)
{
        CAN_t *hdl = device_handle;

        size_t items = 0;
        sys_queue_get_number_of_items(hdl->rxqueue_q, &items);

        device_stat->st_size = items * sizeof(CAN_msg_t);

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Release resources allocated by module.
 *
 * @param  hdl          module instance
 */
//==============================================================================
static void relese_resources(CAN_t *hdl)
{
        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_RESET);
        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_RESET);

        #if defined(RCC_APB1ENR_CAN2EN)
        if ((hdl->major == _CAN1) && (*CANX[_CAN2].APBENR & CANX[_CAN2].APBENR_CANEN)) {
                // when CAN2 is already used then CAN1 cannot be reset

        } else
        #endif
        {
                SET_BIT(*CANX[hdl->major].APBRSTR, CANX[hdl->major].APBRSTR_CANRSTR);
                CLEAR_BIT(*CANX[hdl->major].APBRSTR, CANX[hdl->major].APBRSTR_CANRSTR);
                CLEAR_BIT(*CANX[hdl->major].APBENR, CANX[hdl->major].APBENR_CANEN);

                #if defined(RCC_APB1ENR_CAN2EN)
                if ((hdl->major == _CAN2) && (CAN_HDL[_CAN1] == NULL)) {
                        CLEAR_BIT(*CANX[_CAN1].APBENR, CANX[_CAN1].APBENR_CANEN);
                }
                #endif
        }

        if (hdl->config_mtx) {
                sys_mutex_destroy(hdl->config_mtx);
        }

