devdnl/dnx-rtos/src/system/drivers/can/stm32fx/can.c
        if (hdl->rxqueue_q) {
                sys_queue_destroy(hdl->rxqueue_q);
        }

        for (int i = 0; i < TX_MAILBOXES; i++) {
                if (hdl->txmbox_mtx[i]) {
                        sys_mutex_destroy(hdl->txmbox_mtx[i]);
                }

                if (hdl->txrdy_q[i]) {
                        sys_queue_destroy(hdl->txrdy_q[i]);
                }
        }

        sys_free((void*)&hdl);
}

//==============================================================================
/**
 * @brief  Configure peripheral.
 *
 * @param  hdl          module instance
 * @param  cfg          configuration
 *
 * @return One of errno value.
 */
//==============================================================================
static int configure(CAN_t *hdl, const CAN_config_t *cfg)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                SET_BIT(CANX[hdl->major].CAN->MCR, (CAN_MCR_DBF * __CAN_CFG_DEBUG_FREEZE__)
                                                 | CAN_MCR_TXFP
                                                 | CAN_MCR_RFLM);

                SET_BIT(CANX[hdl->major].CAN->IER, CAN_IER_FMPIE1
                                                 | CAN_IER_FMPIE0
                                                 | CAN_IER_TMEIE);

                if (cfg->auto_bus_off_management) {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_ABOM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_ABOM);
                }

                if (cfg->auto_retransmission) {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_NART);
                } else {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_NART);
                }

                if (cfg->auto_wake_up) {
                        SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_AWUM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_AWUM);
                }

                if (cfg->loopback) {
                        SET_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_LBKM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_LBKM);
                }

                if (cfg->silent) {
                        SET_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_SILM);
                } else {
                        CLEAR_BIT(CANX[hdl->major].CAN->BTR, CAN_BTR_SILM);
                }

                u32_t SJW = cfg->nominal_bit_rate.SJW;
                u32_t TS1 = cfg->nominal_bit_rate.TS1;
                u32_t TS2 = cfg->nominal_bit_rate.TS2;
                u32_t BRP = cfg->nominal_bit_rate.prescaler;

                if ((SJW < 1) || (SJW > 4)) {
                        SJW = min(4, SJW);
                        SJW = max(1, SJW);
                        dev_dbg(hdl, "SJW out of range! Applied %d", SJW);
                }

                if ((TS1 < 1) || (TS1 > 15)) {
                        TS1 = min(15, TS1);
                        TS1 = max(1, TS1);
                        dev_dbg(hdl, "TS1 out of range! Applied %d", TS1);
                }

                if ((TS2 < 1) || (TS2 > 7)) {
                        TS2 = min(7, TS2);
                        TS2 = max(1, TS2);
                        dev_dbg(hdl, "TS2 out of range! Applied %d", TS2);
                }

                if ((BRP < 1) || (BRP > 1024)) {
                        BRP = min(1024, BRP);
                        BRP = max(1, BRP);
                        dev_dbg(hdl, "BRP out of range! Applied %d", BRP);
                }

                CANX[hdl->major].CAN->BTR = (CAN_BTR_LBKM * cfg->loopback)
                                          | (CAN_BTR_SILM * cfg->silent)
                                          | ((SJW - 1) << 24)
                                          | ((TS2 - 1) << 20)
                                          | ((TS1 - 1) << 16)
                                          | ((BRP - 1) <<  0);

                LL_RCC_ClocksTypeDef freq;
                LL_RCC_GetSystemClocksFreq(&freq);
                u32_t PCLK = freq.PCLK1_Frequency;

                hdl->baud = PCLK / (cfg->nominal_bit_rate.prescaler * (1 + TS1 + TS2));
                dev_dbg(hdl, "baud rate: %u bps", hdl->baud);

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to initialization mode.
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_init_mode(CAN_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                err = EIO;

                clock_t tref = sys_get_uptime_ms();

                CLEAR_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_SLEEP);
                SET_BIT(CANX[hdl->major].CAN->MCR, CAN_MCR_INRQ);

                while (not sys_is_time_expired(tref, INIT_TIMEOUT)) {
                        if (CANX[hdl->major].CAN->MSR & CAN_MSR_INAK) {
                                hdl->tx_bytes  = 0;
                                hdl->rx_bytes  = 0;
                                hdl->tx_frames = 0;
                                hdl->rx_frames = 0;
                                err = ESUCC;
                                break;
                        }
                }

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to normal mode (active).
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_normal_mode(CAN_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                err = EIO;

                clock_t tref = sys_get_uptime_ms();

